name: "dinov2_preprocess"
backend: "python"
max_batch_size: 32

input [
  { name: "IMAGE_BYTES" data_type: TYPE_STRING dims: [ 1 ] }
]
output [
  { name: "pixel_values" data_type: TYPE_FP32 dims: [ 3, 224, 224 ] }
]

instance_group [{ kind: KIND_CPU }]
