name: "dinov2_preprocess"
backend: "python"
max_batch_size: 32

input [
  {
    name: "IMAGE"
    data_type: TYPE_STRING
    dims: [ 1 ]  # 1 byte string per sample
  }
]

output [
  {
    name: "input"          # must match dinov2 input name
    data_type: TYPE_FP16   # changed to FP16 to match model.py output
    dims: [ 3, 224, 224 ]
  }
]
