name: "dinov2_preprocess"
backend: "python"
max_batch_size: 8

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ 3, -1, -1 ]
  }
]

output [
  {
    name: "PREPROCESSED_IMAGE"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
] 