name: "preproc"
backend: "python"
max_batch_size: 32

input [
  {
    name: "IMAGE"
    data_type: TYPE_BYTES
    dims: [ 1 ]  # 1 byte string per sample
  }
]

output [
  {
    name: "input"          # must match dinov2 input name
    data_type: TYPE_FP32   # use TYPE_FP32 if your plan is FP32
    dims: [ 3, 224, 224 ]
  }
]
