name: "dinov2_ensemble"
platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ 3, -1, -1 ]
  }
]

output [
  {
    name: "NORMALIZED_FEATURES"
    data_type: TYPE_FP32
    dims: [ 768 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "dinov2_preprocess"
      model_version: 1
      input_map {
        key: "INPUT_IMAGE"
        value: "INPUT_IMAGE"
      }
      output_map {
        key: "PREPROCESSED_IMAGE"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "dinov2_trt"
      model_version: 1
      input_map {
        key: "input"
        value: "preprocessed_image"
      }
      output_map {
        key: "output"
        value: "features"
      }
    },
    {
      model_name: "dinov2_postprocess"
      model_version: 1
      input_map {
        key: "FEATURES"
        value: "features"
      }
      output_map {
        key: "NORMALIZED_FEATURES"
        value: "NORMALIZED_FEATURES"
      }
    }
  ]
} 