name: "dinov2_ensemble"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "IMAGE"
    data_type: TYPE_BYTES
    dims: [ 1 ]
  }
]

output [
  {
    name: "features"
    data_type: TYPE_FP32    # TYPE_FP32 if using FP32 path
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preproc"
      model_version: -1
      input_map { key: "IMAGE" value: "IMAGE" }
      output_map { key: "input" value: "preproc_out" }
    },
    {
      model_name: "dinov2"
      model_version: -1
      input_map  { key: "input"    value: "preproc_out" }
      output_map { key: "features" value: "features" }
    }
  ]
}
