name: "dinov2_postprocess"
backend: "python"
max_batch_size: 32

input  [{ name: "raw_embeds" data_type: TYPE_FP32 dims: [ -1, 768 ] }]
output [{ name: "embeddings" data_type: TYPE_FP32 dims: [ -1, 768 ] }]

instance_group [{ kind: KIND_CPU }]
